Repository: vsiivola/vesamusictraining
Catalog: vesamusictraining/locale/*/LC_MESSAGES/djangojs.po
Languages: fi

source: Music Training | Choose your exercise
fi: Musiikinharjoittelu | Valitse harjoitus

source: Hints
fi: Ohjeita

source: More information
fi: Lis√§tietoja

source: Exercise information
fi: Tietoja harjoituksesta

source: version
fi: versio

source: exercises
fi: harjoitusta

source: completed
fi: tehty

source: score
fi: pisteet

source: Enter
fi: Aloita

source: Play
fi: Soita

source: Music Training
fi: Musiikinharjoittelu

source: News
fi: Uutiset

source: Music Training | Results
fi: Musiikinharjoittelu | Tulokset

source: You got
fi: Sait

source: correct
fi: oikein

source: Continue
fi: Jatka
